2023-12-18/a39e0a172b-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 17:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>busybox/mdev学习</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">busybox/mdev学习</h1>
<p>
两个用法：initial population and dynamic updates.
</p>

<p>
都需要sysfs支持。动态更新需要内核使能热插拔。
</p>

<p>
Here's a typical code snippet from the init script:
[0] mount -t proc proc /proc
[1] mount -t sysfs sysfs /sys
[2] echo /sbin/mdev &gt; /proc/sys/kernel/hotplug
[3] mdev -s
</p>

<p>
Alternatively, without procfs the above becomes:
[1] mount -t sysfs sysfs /sys
[2] sysctl -w kernel.hotplug=/sbin/mdev
[3] mdev -s
</p>


<p>
Of course, a more "full" setup would entail executing this before the previous
code snippet:
[4] mount -t tmpfs -o size=64k,mode=0755 tmpfs /dev
[5] mkdir /dev/pts
[6] mount -t devpts devpts /dev/pts
</p>

<p>
The simple explanation here is that [1] you need to have /sys mounted before
executing mdev.  Then you [2] instruct the kernel to execute /sbin/mdev whenever
a device is added or removed so that the device node can be created or
destroyed.  Then you [3] seed /dev with all the device nodes that were created
while the system was booting.
</p>


<p>
当前通过uevent告知用户层工具设备变动情况，而用户层工具就是udev或者是简化版的busybox
中带的mdev。
要点：事件通知接口：netlink
netlink - communication between kernel and user space (AF_NETLINK)
</p>

<p>
netlink_socket = socket(AF_NETLINK, socket_type, netlink_family);
netlink由一个标准的基于socket的接口，提供给用户层进程使用。以及一套内部kernel API，
提供给内核模块使用。此处只展示用户层API。
socket_type有SOCK_RAW和SOCK_DGRAM两种有效形式，在此是SOCK_DGRAM形式。
netlink_family形式较多，此处为NETLINK_KOBJECT_UEVENT，专门用于传递内核消息到用户层。
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
